tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Anti-virus software
brew "clamav"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Programmatically correct mistyped console commands
brew "thefuck"
# Application launcher and productivity software
cask "alfred"
# Data backup and storage service
cask "backblaze"
# Menu bar icon organizer
cask "bartender"
# E-books management software
cask "calibre"
# Web browser
cask "firefox"
# Screen color temperature controller
cask "flux"
# Corporate typeface for IBM
cask "font-ibm-plex"
cask "font-inconsolata"
cask "font-atkinson-hyperlegible"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-source-sans-pro"
# Automated organization
cask "hazel"
# Keyboard customizer
cask "karibiner-elements"
# Automation software
cask "keyboard-maestro"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Monitors computer mic and webcam
cask "oversight"
# Used to access context-specific actions when text is selected
cask "popclip"
# Backup, recovery and cloning software
cask "superduper"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
mas "Magnet", id: 441258766
mas "OmniFocus", id: 1346203938
